In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('titanic.csv')

In [3]:
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
inputs=df.dropna()
inputs.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [6]:
new_df=inputs.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')
new_df.head()

    Survived  Pclass     Sex   Age     Fare
1          1       1  female  38.0  71.2833
3          1       1  female  35.0  53.1000
6          0       1    male  54.0  51.8625
10         1       3  female   4.0  16.7000
11         1       1  female  58.0  26.5500

In [11]:
new=new_df.reset_index()
new.head()

   index  Survived  Pclass     Sex   Age     Fare
0      1         1       1  female  38.0  71.2833
1      3         1       1  female  35.0  53.1000
2      6         0       1    male  54.0  51.8625
3     10         1       3  female   4.0  16.7000
4     11         1       1  female  58.0  26.5500

In [12]:
new.columns

Index(['index', 'Survived', 'Pclass', 'Sex', 'Age', 'Fare'], dtype='object')

In [14]:
x=new.drop(['index','Survived'],axis='columns')
x

     Pclass     Sex   Age     Fare
0         1  female  38.0  71.2833
1         1  female  35.0  53.1000
2         1    male  54.0  51.8625
3         3  female   4.0  16.7000
4         1  female  58.0  26.5500
..      ...     ...   ...      ...
178       1  female  47.0  52.5542
179       1    male  33.0   5.0000
180       1  female  56.0  83.1583
181       1  female  19.0  30.0000
182       1    male  26.0  30.0000

[183 rows x 4 columns]

In [15]:
from sklearn.preprocessing import LabelEncoder

In [16]:
sex_n=LabelEncoder()

In [17]:
x['Sex_n']=sex_n.fit_transform(x['Sex'])
x.head()

   Pclass     Sex   Age     Fare  Sex_n
0       1  female  38.0  71.2833      0
1       1  female  35.0  53.1000      0
2       1    male  54.0  51.8625      1
3       3  female   4.0  16.7000      0
4       1  female  58.0  26.5500      0

In [18]:
y=new['Survived']

In [19]:
len(x),len(y)

(183, 183)

In [22]:
X=x.drop('Sex',axis='columns')
X.head()

   Pclass   Age     Fare  Sex_n
0       1  38.0  71.2833      0
1       1  35.0  53.1000      0
2       1  54.0  51.8625      1
3       3   4.0  16.7000      0
4       1  58.0  26.5500      0

In [23]:
from sklearn.model_selection import train_test_split

In [146]:
x_train,x_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [147]:
from sklearn.tree import DecisionTreeClassifier

In [148]:
model=DecisionTreeClassifier()

In [149]:
model.fit(x_train,y_train)

DecisionTreeClassifier()

In [150]:
model.score(x_test,y_test)

0.918918918918919

In [151]:
model.predict([[1,54.0,51.8625,1]])

array([0], dtype=int64)

In [152]:
y[2]

0